// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let x = prompt('введіть число');
// if (x != 0){
//     document.write(`<div>Вірно</div>`)
// }
// else {
//     document.write(`<div>НЕВірно</div>`)
// }

// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
//
// let time = +prompt('введіть число від 0 до 59');
// if (time >= 0 && time <15){
//     document.write(`Перша частина`)
// }
// else if (time >=15 && time<30){
//     document.write(`Друга частина`)
// }
// else if (time >=30 && time<45){
//     document.write(`Третя частина`)
// }
// else if (time >=45 && time <=59){
//     document.write(`Четверта частина`)
// }
// else {
//     document.write(`невірний ввод`)
// }
// // - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//
// let day = prompt('Введіть число від 1 до 31');
// if (typeof day === "number"){
//     if(day >= 1 && day <= 10){
//         console.log('1 декада')
//     }
//     else if (day >= 11 && day <= 20){
//         console.log('2 декада')
//     }
//     else if (day >=21 && day <=31){
//         console.log('3 декада')
//     }
//     else {
//         console.log('введіть правильне число')
//     }
// }
// else {
//     console.log('Це не числа!')
// }

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

// let week = prompt('Введіть день тижня від 1 до 7');
// switch (week){
//     case '1':
//         console.log('Навчання');
//         break;
//     case '2':
//         console.log('Робота');
//         break;
//     case '3':
//         console.log('Театр');
//         break;
//     case '4':
//         console.log('Кіно');
//         break;
//     case '5':
//         console.log('Спорт');
//         break;
//     case '6':
//         console.log('Природа');
//         break;
//     case '7':
//         console.log('Читання');
//         break;
//     default:
//         console.log('Невірний ввод')
// }

//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.

let x = +prompt('Введіть 1 число');
let y = +prompt('Введіть 2 число');
if(x > y){
    console.log(`${x} більше за ${y}`)
}
else if(x < y){
    console.log(`${y} більше за ${x}`)
}
else if(x === y){
    console.log('Числа рівні')
}
else {
    console.log('Невірний ввод')
}
