// Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//    Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >=3){document.write('це великий масив, в якому  3 і більше елементи')}
else {document.write('це маленький масив')}

//Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
  //  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
let num1 = 10;
let num2 = 7;
let num3 = 5;
if(num1 > num2 && num2 > num3 || num3 > num2 && num2 > num1){console.log(num2, ' - середнє число')}
else if(num2 > num1 && num1 > num3 || num3 > num1 && num1 > num2){console.log(num1, ' - середнє число, і знаходиться воно між двома іншими')}
else if(num2 > num3 && num3 > num1 || num1 > num3 && num3 > num2){console.log(num3, ' - середнє число')};

//Перепишіть конструкцію if з використанням умовного оператора '?':
//let result;
//if (a + b < 4) {
  //  result = 'Мало';
//} else {
  //  result = 'Багато';
//}
let a = 5;
let b = 2;
(a + b < 4) ? (console.log(' Мало')) : (console.log(' Багато'))

//Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
//напишіть це тернарним оператором
let x = 0;
(x > 0) ? (console.log('це позитивне число')) : (x === 0) ? (console.log(' це = 0')) : (console.log('це негативне число'))
