// - Дано натуральное число n. Выведите все числа от 1 до n.

let foo = (n) =>{
    for(i=1;i<=n;i++){
      console.log(i)
    }
}
foo(15)

// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

let foo1 = (a,b) =>{
    if(a < b){
        for(let i=a;i<=b;i++){
            console.log(i)
        }
    }
    else if(a > b){
        for(let i=a;i>=b;i--){
            console.log(i)
        }
    }
    else {
        console.log(`wrong`)
    }
}
foo1(10,1)

// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

let foo3 = (arr,i) => {
        [arr[i], arr[i+1]] = [arr[i+1], arr[i]];
            console.log(arr)
}
foo3([0,1,2,3,4,5,6],0)

// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]

let foo4 = (ar) => {
    for(const el of ar){
        if(ar[i] === 0){
        [el[i], el[i+1]] = [el[i+1], el[i]]; break
    }}
    console.log(ar)
}

foo4([0,1,0,2,0,3,0,4])   // только 1 ноль переносится, другие нули не могу никак перенести


