//Користувач вводить або має два числа.
//Потрібно знайти та вивести максимальне число з тих двох .Також потрібно врахувати коли введені рівні числа.
let num1 = +prompt('Введи первое число');
let num2 = +prompt('Введи второе число');
if(num1 > num2) {document.write(num1,' більше за ',num2)}
else if (num1 === num2) {document.write('Введені числа ',num1,' і ',num2, ' - рівні')}
else if(num2 > num1) {document.write(num2,' більше за ',num1)}
else {document.write(' ЩО ВИ ВВЕЛИ?')}

//У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
//Користувач вводить номер квартири просто в змінні або через prompt('') .
    //Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let numFlat = +prompt('Введите номер квартиры (90 квартир)');
if(numFlat >=1 && numFlat <= 20){document.write(' Ваша квартира в 1 подъезде')}
else if(numFlat >=21 && numFlat <= 48){document.write(' Ваша квартира во 2 подъезде')}
else if(numFlat >=49 && numFlat <= 90){document.write(' Ваша квартира в 3 подъезде')}
else(document.write(' Введите правильный номер!'))

//Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let number1 = +prompt('Введи число');
(number1 === 10) ? (document.write(' ВІРНО')) : (document.write(' НЕВІРНО'))

//Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
  //  якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
//якщо в змінну записали щось інше, спрацьовує else

let x = null;
if (typeof x === "number"){console.log('1')}
else if(typeof x === "string"){console.log('2')}
else if(typeof x === "boolean"){console.log('3')}
else if(typeof x === "object"){console.log('4')}
else {console.log(' Що це?')}

//За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let answer = +prompt('введіть число від 1 до 5');
switch (answer){
    case 1:
        document.write(' Ви виграли Авто');
        break;
    case 2:
        document.write(' Ви виграли Мото');
        break;
    case 3:
        document.write(' Ви виграли Телефон');
        break;
    case 4:
        document.write(' Ви виграли Велисопидед');
        break;
    case 5:
        document.write(' Ви нічого не виграли');
        break;
    default:
        document.write(' Вы не правильно ввели число')
}





