//--створити масив з:
//    - з 5 числових значень
//- з 5 стічкових значень
//- з 5 значень стрічкового, числового та булевого типу
//- та вивести його в консоль

let num = [1,2,3,4,5];
let str = ['hello', 'katya', 'how', 'are','you'];
let all = [true, 1, 'hello', 2, 'katya'];
console.log(num);
console.log(str);
console.log(all)

//Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

let arr = [];
arr[0] = 'hello';
arr[1] = true;
arr[2] = 100;
console.log(arr)

//За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
let i = [];
for (i = 0; i < 10; i++) {
    document.write(`<div>довільний текст</div>`);
}

for (i = 0; i < 10; i++) {
    document.write(`<div>довільний текст, індекс ${i}</div>`);
}
i = 0;
while (i < 20) {
    document.write(`<h1>довільний текст</h1>`);
    i++;
}
i = 0;
while (i < 20) {
    document.write(`<h1>довільний текст, індекс ${i}</h1>`);
    i++;
}

//- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
//- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
//- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
//- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
//- Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
//- Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
let arr2 = [1,2,3,4,5,6,7,8,9,0];
for (a=0; a<arr2.length;a++){
    console.log(arr2[a])
}
let arr3 = ['a','b','c','d','e','f','g','h','i','j']
for (a=0;a<arr3.length;a++){
    console.log(arr3[a])
}
let arr4 = ['true','b',1,'d',false,'f',5,'h',10,'j']
for (a=0;a<arr4.length;a++){
    console.log(arr4[a])
}
let arr5 = [true,'b',1,'d',false,'f',5,'h',10,'j']
for(a=0;a<arr5.length;a++){
    if(typeof arr5[a] === 'boolean'){
        document.write(arr5[a],' ')
    }
}
for(a=0;a<arr5.length;a++){
    if(typeof arr5[a] === 'string'){
        document.write(arr5[a],' ')
    }
}
for(a=0;a<arr5.length;a++){
    if(typeof arr5[a] === 'number'){
        document.write(arr5[a],' ')
    }
}
//- Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
//- Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//- Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//- Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
//- Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
//- Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
let arr6 = [];
arr6[0] = 1;
arr6[1] = 'a';
arr6[2] = 2;
arr6[3] = 'b';
arr6[4] = 3;
arr6[5] = 'c';
arr6[6] = 4;
arr6[7] = 'd';
arr6[8] = 5;
arr6[9] = true;
for(a=0;a<10;a++){
    console.log(arr6[a])
}
for(a=0;a<10;a++) {
    console.log(a);
    document.write(`${a} <br>`)
}
for(a=0;a<100;a++){
    console.log(a);
    document.write(`${a}`)
}
for(a=0;a<100;a+=2){
    console.log(a);
    document.write(`${a}`)
}
for(a=0;a<100;a++){
    if(a % 2 === 0 && a != 0){
    console.log(a);
    document.write(`${a}`)
}}
for(a=0;a<100;a++){
    if(a % 2 === 1){
        console.log(a);
        document.write(`${a}`)
    }}



